[
  "Extensions and alterations to a terraced house in Putney. A search for a solution to making an 'inside-outside' space with attention to the sensory experience...",
  "Loft, side and double storey rear extensions to a semi-detached house in a conservation area; designed to suit particular family requirements.",
  "We maximised volumes within the existing semi-detached Wandsworth house and with a loft, side and rear extensions. There are a number to dormers to...",
  "An enigmatic new build, 3-bed, multigenerational house in Putney behind a reclaimed brick wall. The double-skinned, gently curving roof is based on...",
  "A project for a loft extension to create a spacious rental property. We created a layout to suit a variety of lifestyles, including a sliding wall partition...",
  "The essential alternation to this 1 bed flat was to remove existing partitions which formed a small, dark passage and install an angled wall and a...",
  "Ground floor and rear extension to a semi-detached house in a conservation area near Clapham Common. Carefully considered scale and extent of the additions...",
  "Rear loft extension and reworking the ground floor of a terraced house on a constrained site near Wandsworth Town. A challenging, small courtyard garden...",
  "A side and rear ground floor and loft and rear 'pod' extension to a terraced house. We kept the memory and feeling of things that the owner liked...",
  "Complete modernisation and refurbishment of a terraced house in Putney including ground, first floor and loft extension. A young family dreamed of...",
  "A three storey rear extension to a terraced house in a conservation area in Wandsworth, maximising potential area, creating a strong relationship with the garden...",
  "A London terraced house with a loft and lower-ground floor rear-infill extensions. With an apparent modest simplicity and some formality, we...",
  "Top floor flat alterations and refurbishment for a bachelor in RBK&C. Alterations included removal of partitions and a full removal of all the...",
  "A new, private family house on a suburban sub-division. The brief for a 'Mediterranean' style house with bedrooms and bathrooms upstairs...",
  "A new house on the terraced site of a ruined farm build, in a VAST landscape, for a reclusive client. Comfortable habitable conditions created...",
  "Additions, alterations and refurbishment transforming a tired house into a much loved family home. The loft form followed 3D studies and strategies...",
  "A ground floor rear extension and a loft conversion to a modest terraced house. The challenge we met was to achieve a practical, economic and inspiring..."
]
